7767517
89 99
Input            input_img                0 1 input_img
Convolution      116                      1 1 input_img 116 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=0 6=432
Split            splitncnn_0              1 2 116 116_splitncnn_0 116_splitncnn_1
Convolution      117                      1 1 116_splitncnn_1 117 0=32 1=1 11=1 2=1 12=1 3=2 13=2 4=0 14=0 5=1 6=512
Convolution      118                      1 1 116_splitncnn_0 118 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=1 6=256
Convolution      119                      1 1 118 119 0=16 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 5=1 6=2304
Convolution      120                      1 1 119 120 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=1 6=512
BinaryOp         121                      2 1 120 117 121 0=0
ReLU             122                      1 1 121 122
Split            splitncnn_1              1 2 122 122_splitncnn_0 122_splitncnn_1
Convolution      123                      1 1 122_splitncnn_1 123 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=1 6=1024
Convolution      124                      1 1 122_splitncnn_0 124 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=1 6=512
Convolution      125                      1 1 124 125 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=1 6=2304
Convolution      126                      1 1 125 126 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=1 6=512
BinaryOp         127                      2 1 126 123 127 0=0
ReLU             128                      1 1 127 128
Split            splitncnn_2              1 2 128 128_splitncnn_0 128_splitncnn_1
Convolution      129                      1 1 128_splitncnn_1 129 0=64 1=1 11=1 2=1 12=1 3=2 13=2 4=0 14=0 5=1 6=2048
Convolution      130                      1 1 128_splitncnn_0 130 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=1 6=1024
Convolution      131                      1 1 130 131 0=32 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 5=1 6=9216
Convolution      132                      1 1 131 132 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=1 6=2048
BinaryOp         133                      2 1 132 129 133 0=0
ReLU             134                      1 1 133 134
Split            splitncnn_3              1 2 134 134_splitncnn_0 134_splitncnn_1
Convolution      135                      1 1 134_splitncnn_1 135 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=1 6=4096
Convolution      136                      1 1 134_splitncnn_0 136 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=1 6=2048
Convolution      137                      1 1 136 137 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=1 6=9216
Convolution      138                      1 1 137 138 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=1 6=2048
BinaryOp         139                      2 1 138 135 139 0=0
ReLU             140                      1 1 139 140
Split            splitncnn_4              1 2 140 140_splitncnn_0 140_splitncnn_1
Convolution      141                      1 1 140_splitncnn_1 141 0=128 1=1 11=1 2=1 12=1 3=2 13=2 4=0 14=0 5=1 6=8192
Convolution      142                      1 1 140_splitncnn_0 142 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=1 6=4096
Convolution      143                      1 1 142 143 0=64 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 5=1 6=36864
Convolution      144                      1 1 143 144 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=1 6=8192
BinaryOp         145                      2 1 144 141 145 0=0
ReLU             146                      1 1 145 146
Split            splitncnn_5              1 2 146 146_splitncnn_0 146_splitncnn_1
Convolution      147                      1 1 146_splitncnn_1 147 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=1 6=16384
Convolution      148                      1 1 146_splitncnn_0 148 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=1 6=8192
Convolution      149                      1 1 148 149 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=1 6=36864
Convolution      150                      1 1 149 150 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=1 6=8192
BinaryOp         151                      2 1 150 147 151 0=0
ReLU             152                      1 1 151 152
Split            splitncnn_6              1 2 152 152_splitncnn_0 152_splitncnn_1
Convolution      153                      1 1 152_splitncnn_1 153 0=256 1=1 11=1 2=1 12=1 3=2 13=2 4=0 14=0 5=1 6=32768
Convolution      154                      1 1 152_splitncnn_0 154 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=1 6=16384
Convolution      155                      1 1 154 155 0=128 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 5=1 6=147456
Convolution      156                      1 1 155 156 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=1 6=32768
BinaryOp         157                      2 1 156 153 157 0=0
ReLU             158                      1 1 157 158
Split            splitncnn_7              1 2 158 158_splitncnn_0 158_splitncnn_1
Convolution      159                      1 1 158_splitncnn_1 159 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=1 6=65536
Convolution      160                      1 1 158_splitncnn_0 160 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=1 6=32768
Convolution      161                      1 1 160 161 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=1 6=147456
Convolution      162                      1 1 161 162 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=1 6=32768
BinaryOp         163                      2 1 162 159 163 0=0
ReLU             164                      1 1 163 164
Split            splitncnn_8              1 2 164 164_splitncnn_0 164_splitncnn_1
Convolution      165                      1 1 164_splitncnn_1 165 0=512 1=1 11=1 2=1 12=1 3=2 13=2 4=0 14=0 5=1 6=131072
Convolution      166                      1 1 164_splitncnn_0 166 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=1 6=65536
Convolution      167                      1 1 166 167 0=256 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 5=1 6=589824
Convolution      168                      1 1 167 168 0=512 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=1 6=131072
BinaryOp         169                      2 1 168 165 169 0=0
ReLU             170                      1 1 169 170
Split            splitncnn_9              1 2 170 170_splitncnn_0 170_splitncnn_1
Convolution      171                      1 1 170_splitncnn_1 171 0=512 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=1 6=262144
Convolution      172                      1 1 170_splitncnn_0 172 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=1 6=131072
Convolution      173                      1 1 172 173 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=1 6=589824
Convolution      174                      1 1 173 174 0=512 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=1 6=131072
BinaryOp         175                      2 1 174 171 175 0=0
ReLU             176                      1 1 175 176
Deconvolution    177                      1 1 176 177 0=512 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=1 6=2359296
Deconvolution    178                      1 1 177 178 0=256 1=4 11=4 2=1 12=1 3=2 13=2 4=1 14=1 5=1 6=2097152
Deconvolution    179                      1 1 178 179 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=1 6=589824
Deconvolution    180                      1 1 179 180 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=1 6=589824
Deconvolution    181                      1 1 180 181 0=128 1=4 11=4 2=1 12=1 3=2 13=2 4=1 14=1 5=1 6=524288
Deconvolution    182                      1 1 181 182 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=1 6=147456
Deconvolution    183                      1 1 182 183 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=1 6=147456
Deconvolution    184                      1 1 183 184 0=64 1=4 11=4 2=1 12=1 3=2 13=2 4=1 14=1 5=1 6=131072
Deconvolution    185                      1 1 184 185 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=1 6=36864
Deconvolution    186                      1 1 185 186 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=1 6=36864
Deconvolution    187                      1 1 186 187 0=32 1=4 11=4 2=1 12=1 3=2 13=2 4=1 14=1 5=1 6=32768
Deconvolution    188                      1 1 187 188 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=1 6=9216
Deconvolution    189                      1 1 188 189 0=16 1=4 11=4 2=1 12=1 3=2 13=2 4=1 14=1 5=1 6=8192
Deconvolution    190                      1 1 189 190 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=1 6=2304
Deconvolution    191                      1 1 190 191 0=3 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=1 6=432
Deconvolution    192                      1 1 191 192 0=3 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=1 6=81
Deconvolution    pos_img                  1 1 192 pos_img 0=3 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=1 6=81
